<a href="https://colab.research.google.com/github/Hydixoo/PIS/blob/main/PIS2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Разведочный анализ данных

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

In [2]:
# data import

data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data',
    header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [3]:
names = ["ID", "RI", "na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['ID'])
data.head(3)

        RI     na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [5]:
data['Class'].replace({1: "building_float",
                       2: "building_non_float",
                       3: "vehicle_float_",
                       4: "vehicle_non_float",
                       5: "containers",
                       6: "tableware",
                       7: "headlamps"
                      }, inplace=True)
data.head(3)

        RI     na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float

In [7]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

data.head(10)

        RI     na    Mg    Al     Si     K    Ca   Ba    Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00  building_float
1  1.51761  13.89  3.60   NaN  72.73  0.48  7.83  0.0  0.00  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00  building_float
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0   NaN  building_float
6  1.51743  13.30  3.60   NaN  73.09  0.58  8.17  NaN  0.00  building_float
7  1.51756  13.15  3.61  1.05  73.24  0.57  8.24  0.0  0.00  building_float
8  1.51918  14.04  3.58  1.37  72.08  0.56  8.30  NaN  0.00  building_float
9  1.51755  13.00  3.60  1.36  72.99  0.57  8.40  0.0  0.11  building_float

In [8]:
# data visualization

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   na      199 non-null    float64
 2   Mg      201 non-null    float64
 3   Al      199 non-null    float64
 4   Si      195 non-null    float64
 5   K       197 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      197 non-null    float64
 8   Fe      197 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [9]:
data.describe()

               RI          na          Mg  ...          Ca          Ba          Fe
count  201.000000  199.000000  201.000000  ...  195.000000  197.000000  197.000000
mean     1.518430   13.412663    2.751940  ...    9.008256    0.173756    0.053807
std      0.003082    0.824580    1.395176  ...    1.462610    0.495099    0.096718
min      1.511150   10.730000    0.000000  ...    5.790000    0.000000    0.000000
25%      1.516550   12.935000    2.280000  ...    8.220000    0.000000    0.000000
50%      1.517690   13.310000    3.480000  ...    8.610000    0.000000    0.000000
75%      1.519180   13.850000    3.610000  ...    9.405000    0.000000    0.090000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [10]:
display(data['Class'].describe())
print('============================')
display(data['Class'].value_counts())

count                    199
unique                     6
top       building_non_float
freq                      70
Name: Class, dtype: object

============================

building_non_float    70
building_float        63
headlamps             29
vehicle_float_        17
containers            11
tableware              9
Name: Class, dtype: int64